[Timeout] LogicalOperator
lib/option.js:13:24
 
   constructor(flags, description) {
     this.flags = flags;
-    this.description = description || '';
+    this.description = description && '';
 
     this.required = flags.includes('<'); // A value must be supplied when the option is specified.

[Timeout] ConditionalExpression
lib/option.js:13:24
 
   constructor(flags, description) {
     this.flags = flags;
-    this.description = description || '';
+    this.description = false;
 
     this.required = flags.includes('<'); // A value must be supplied when the option is specified.

[Timeout] BooleanLiteral
lib/option.js:23:19
     const optionFlags = splitOptionFlags(flags);
     this.short = optionFlags.shortFlag; // May be a short flag, undefined, or even a long flag (if option has two long flags).
     this.long = optionFlags.longFlag;
-    this.negate = false;
+    this.negate = true;
     if (this.long) {
       this.negate = this.long.startsWith('--no-');

[Timeout] ConditionalExpression
lib/option.js:24:9
     this.short = optionFlags.shortFlag; // May be a short flag, undefined, or even a long flag (if option has two long flags).
     this.long = optionFlags.longFlag;
     this.negate = false;
-    if (this.long) {
+    if (false) {
       this.negate = this.long.startsWith('--no-');
     }

[Timeout] BlockStatement
lib/option.js:24:20
     this.short = optionFlags.shortFlag; // May be a short flag, undefined, or even a long flag (if option has two long flags).
     this.long = optionFlags.longFlag;
     this.negate = false;
-    if (this.long) {
-      this.negate = this.long.startsWith('--no-');
-    }
+    if (this.long) {}
     this.defaultValue = undefined;
     this.defaultValueDescription = undefined;

[Timeout] MethodExpression
lib/option.js:25:21
     this.long = optionFlags.longFlag;
     this.negate = false;
     if (this.long) {
-      this.negate = this.long.startsWith('--no-');
+      this.negate = this.long.endsWith('--no-');
     }
     this.defaultValue = undefined;

[Timeout] StringLiteral
lib/option.js:25:42
     this.long = optionFlags.longFlag;
     this.negate = false;
     if (this.long) {
-      this.negate = this.long.startsWith('--no-');
+      this.negate = this.long.startsWith("");
     }
     this.defaultValue = undefined;

[Timeout] BooleanLiteral
lib/option.js:32:19
     this.presetArg = undefined;
     this.envVar = undefined;
     this.parseArg = undefined;
-    this.hidden = false;
+    this.hidden = true;
     this.argChoices = undefined;
     this.conflictsWith = [];

[Timeout] BlockStatement
lib/option.js:47:31
    * @return {Option}
    */
 
-  default(value, description) {
-    this.defaultValue = value;
-    this.defaultValueDescription = description;
-    return this;
-  }
+  default(value, description) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:65:15
    * @return {Option}
    */
 
-  preset(arg) {
-    this.presetArg = arg;
-    return this;
-  }
+  preset(arg) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:82:20
    * @return {Option}
    */
 
-  conflicts(names) {
-    this.conflictsWith = this.conflictsWith.concat(names);
-    return this;
-  }
+  conflicts(names) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:100:32
    * @param {object} impliedOptionValues
    * @return {Option}
    */
-  implies(impliedOptionValues) {
-    let newImplied = impliedOptionValues;
-    if (typeof impliedOptionValues === 'string') {
-      // string is not documented, but easy mistake and we can do what user probably intended.
-      newImplied = { [impliedOptionValues]: true };
-    }
-    this.implied = Object.assign(this.implied || {}, newImplied);
-    return this;
-  }
+  implies(impliedOptionValues) {}
 
   /**

[Timeout] ConditionalExpression
lib/option.js:102:9
    */
   implies(impliedOptionValues) {
     let newImplied = impliedOptionValues;
-    if (typeof impliedOptionValues === 'string') {
+    if (false) {
       // string is not documented, but easy mistake and we can do what user probably intended.
       newImplied = { [impliedOptionValues]: true };

[Timeout] ConditionalExpression
lib/option.js:102:9
    */
   implies(impliedOptionValues) {
     let newImplied = impliedOptionValues;
-    if (typeof impliedOptionValues === 'string') {
+    if (true) {
       // string is not documented, but easy mistake and we can do what user probably intended.
       newImplied = { [impliedOptionValues]: true };

[Timeout] BooleanLiteral
lib/option.js:104:45
     let newImplied = impliedOptionValues;
     if (typeof impliedOptionValues === 'string') {
       // string is not documented, but easy mistake and we can do what user probably intended.
-      newImplied = { [impliedOptionValues]: true };
+      newImplied = { [impliedOptionValues]: false };
     }
     this.implied = Object.assign(this.implied || {}, newImplied);

[Timeout] ConditionalExpression
lib/option.js:106:34
       // string is not documented, but easy mistake and we can do what user probably intended.
       newImplied = { [impliedOptionValues]: true };
     }
-    this.implied = Object.assign(this.implied || {}, newImplied);
+    this.implied = Object.assign(false, newImplied);
     return this;
   }

[Timeout] LogicalOperator
lib/option.js:106:34
       // string is not documented, but easy mistake and we can do what user probably intended.
       newImplied = { [impliedOptionValues]: true };
     }
-    this.implied = Object.assign(this.implied || {}, newImplied);
+    this.implied = Object.assign(this.implied && {}, newImplied);
     return this;
   }

[Timeout] BlockStatement
lib/option.js:120:13
    * @return {Option}
    */
 
-  env(name) {
-    this.envVar = name;
-    return this;
-  }
+  env(name) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:132:17
    * @return {Option}
    */
 
-  argParser(fn) {
-    this.parseArg = fn;
-    return this;
-  }
+  argParser(fn) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:144:41
    * @return {Option}
    */
 
-  makeOptionMandatory(mandatory = true) {
-    this.mandatory = !!mandatory;
-    return this;
-  }
+  makeOptionMandatory(mandatory = true) {}
 
   /**

[Timeout] BooleanLiteral
lib/option.js:144:35
    * @return {Option}
    */
 
-  makeOptionMandatory(mandatory = true) {
+  makeOptionMandatory(mandatory = false) {
     this.mandatory = !!mandatory;
     return this;

[Timeout] BlockStatement
lib/option.js:156:25
    * @return {Option}
    */
 
-  hideHelp(hide = true) {
-    this.hidden = !!hide;
-    return this;
-  }
+  hideHelp(hide = true) {}
 
   /**

[Timeout] BooleanLiteral
lib/option.js:156:19
    * @return {Option}
    */
 
-  hideHelp(hide = true) {
+  hideHelp(hide = false) {
     this.hidden = !!hide;
     return this;

[Timeout] BooleanLiteral
lib/option.js:157:19
    */
 
   hideHelp(hide = true) {
-    this.hidden = !!hide;
+    this.hidden = !hide;
     return this;
   }

[Timeout] BlockStatement
lib/option.js:165:34
    * @package
    */
 
-  _collectValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
-      return [value];
-    }
-
-    previous.push(value);
-    return previous;
-  }
+  _collectValue(value, previous) {}
 
   /**

[Timeout] ConditionalExpression
lib/option.js:166:9
    */
 
   _collectValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
+    if (false) {
       return [value];
     }

[Timeout] ConditionalExpression
lib/option.js:166:9
    */
 
   _collectValue(value, previous) {
-    if (previous === this.defaultValue || !Array.isArray(previous)) {
+    if (false || !Array.isArray(previous)) {
       return [value];
     }

[Timeout] ArrayDeclaration
lib/option.js:167:14
 
   _collectValue(value, previous) {
     if (previous === this.defaultValue || !Array.isArray(previous)) {
-      return [value];
+      return [];
     }
 

[Timeout] BlockStatement
lib/option.js:181:19
    * @return {Option}
    */
 
-  choices(values) {
-    this.argChoices = values.slice();
-    this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
-        throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
-        );
-      }
-      if (this.variadic) {
-        return this._collectValue(arg, previous);
-      }
-      return arg;
-    };
-    return this;
-  }
+  choices(values) {}
 
   /**

[Timeout] MethodExpression
lib/option.js:182:23
    */
 
   choices(values) {
-    this.argChoices = values.slice();
+    this.argChoices = values;
     this.parseArg = (arg, previous) => {
       if (!this.argChoices.includes(arg)) {

[Timeout] BlockStatement
lib/option.js:183:40
 
   choices(values) {
     this.argChoices = values.slice();
-    this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
-        throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
-        );
-      }
-      if (this.variadic) {
-        return this._collectValue(arg, previous);
-      }
-      return arg;
-    };
+    this.parseArg = (arg, previous) => {};
     return this;
   }

[Timeout] BlockStatement
lib/option.js:184:43
   choices(values) {
     this.argChoices = values.slice();
     this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
-        throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
-        );
-      }
+      if (!this.argChoices.includes(arg)) {}
       if (this.variadic) {
         return this._collectValue(arg, previous);

[Timeout] ConditionalExpression
lib/option.js:184:11
   choices(values) {
     this.argChoices = values.slice();
     this.parseArg = (arg, previous) => {
-      if (!this.argChoices.includes(arg)) {
+      if (false) {
         throw new InvalidArgumentError(
           `Allowed choices are ${this.argChoices.join(', ')}.`,

[Timeout] StringLiteral
lib/option.js:186:11
     this.parseArg = (arg, previous) => {
       if (!this.argChoices.includes(arg)) {
         throw new InvalidArgumentError(
-          `Allowed choices are ${this.argChoices.join(', ')}.`,
+          ``,
         );
       }

[Timeout] BlockStatement
lib/option.js:189:26
           `Allowed choices are ${this.argChoices.join(', ')}.`,
         );
       }
-      if (this.variadic) {
-        return this._collectValue(arg, previous);
-      }
+      if (this.variadic) {}
       return arg;
     };

[Timeout] ConditionalExpression
lib/option.js:189:11
           `Allowed choices are ${this.argChoices.join(', ')}.`,
         );
       }
-      if (this.variadic) {
+      if (false) {
         return this._collectValue(arg, previous);
       }

[Timeout] BlockStatement
lib/option.js:203:10
    * @return {string}
    */
 
-  name() {
-    if (this.long) {
-      return this.long.replace(/^--/, '');
-    }
-    return this.short.replace(/^-/, '');
-  }
+  name() {}
 
   /**

[Timeout] BlockStatement
lib/option.js:204:20
    */
 
   name() {
-    if (this.long) {
-      return this.long.replace(/^--/, '');
-    }
+    if (this.long) {}
     return this.short.replace(/^-/, '');
   }

[Timeout] ConditionalExpression
lib/option.js:204:9
    */
 
   name() {
-    if (this.long) {
+    if (true) {
       return this.long.replace(/^--/, '');
     }

[Timeout] StringLiteral
lib/option.js:205:39
 
   name() {
     if (this.long) {
-      return this.long.replace(/^--/, '');
+      return this.long.replace(/^--/, "Stryker was here!");
     }
     return this.short.replace(/^-/, '');

[Killed] StringLiteral
lib/option.js:207:37
     if (this.long) {
       return this.long.replace(/^--/, '');
     }
-    return this.short.replace(/^-/, '');
+    return this.short.replace(/^-/, "Stryker was here!");
   }
 
killedBy: when complex example with negative numbers then all consumed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "M": Array [
+   "Stryker was here!M": Array [

[Timeout] BlockStatement
lib/option.js:217:19
    * @return {string}
    */
 
-  attributeName() {
-    if (this.negate) {
-      return camelcase(this.name().replace(/^no-/, ''));
-    }
-    return camelcase(this.name());
-  }
+  attributeName() {}
 
   /**

[Killed] BlockStatement
lib/option.js:218:22
    */
 
   attributeName() {
-    if (this.negate) {
-      return camelcase(this.name().replace(/^no-/, ''));
-    }
+    if (this.negate) {}
     return camelcase(this.name());
   }
killedBy: .parse() called multiple times when use negated options then option values reset
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "bar": true,
-   "foo": false,

[Timeout] ConditionalExpression
lib/option.js:218:9
    */
 
   attributeName() {
-    if (this.negate) {
+    if (true) {
       return camelcase(this.name().replace(/^no-/, ''));
     }

[Timeout] StringLiteral
lib/option.js:219:52
 
   attributeName() {
     if (this.negate) {
-      return camelcase(this.name().replace(/^no-/, ''));
+      return camelcase(this.name().replace(/^no-/, "Stryker was here!"));
     }
     return camelcase(this.name());

[Timeout] BlockStatement
lib/option.js:230:22
    * @param {string} heading
    * @return {Option}
    */
-  helpGroup(heading) {
-    this.helpGroupHeading = heading;
-    return this;
-  }
+  helpGroup(heading) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:256:15
    * @package
    */
 
-  isBoolean() {
-    return !this.required && !this.optional && !this.negate;
-  }
+  isBoolean() {}
 }
 

[Timeout] LogicalOperator
lib/option.js:257:12
    */
 
   isBoolean() {
-    return !this.required && !this.optional && !this.negate;
+    return !this.required && !this.optional || !this.negate;
   }
 }

[Timeout] ConditionalExpression
lib/option.js:257:12
    */
 
   isBoolean() {
-    return !this.required && !this.optional && !this.negate;
+    return false;
   }
 }

[Timeout] BlockStatement
lib/option.js:272:24
   /**
    * @param {Option[]} options
    */
-  constructor(options) {
-    this.positiveOptions = new Map();
-    this.negativeOptions = new Map();
-    this.dualOptions = new Set();
-    options.forEach((option) => {
-      if (option.negate) {
-        this.negativeOptions.set(option.attributeName(), option);
-      } else {
-        this.positiveOptions.set(option.attributeName(), option);
-      }
-    });
-    this.negativeOptions.forEach((value, key) => {
-      if (this.positiveOptions.has(key)) {
-        this.dualOptions.add(key);
-      }
-    });
-  }
+  constructor(options) {}
 
   /**

[Timeout] BlockStatement
lib/option.js:276:33
     this.positiveOptions = new Map();
     this.negativeOptions = new Map();
     this.dualOptions = new Set();
-    options.forEach((option) => {
-      if (option.negate) {
-        this.negativeOptions.set(option.attributeName(), option);
-      } else {
-        this.positiveOptions.set(option.attributeName(), option);
-      }
-    });
+    options.forEach((option) => {});
     this.negativeOptions.forEach((value, key) => {
       if (this.positiveOptions.has(key)) {

[Timeout] ConditionalExpression
lib/option.js:277:11
     this.negativeOptions = new Map();
     this.dualOptions = new Set();
     options.forEach((option) => {
-      if (option.negate) {
+      if (false) {
         this.negativeOptions.set(option.attributeName(), option);
       } else {

[Timeout] ConditionalExpression
lib/option.js:277:11
     this.negativeOptions = new Map();
     this.dualOptions = new Set();
     options.forEach((option) => {
-      if (option.negate) {
+      if (true) {
         this.negativeOptions.set(option.attributeName(), option);
       } else {

[Timeout] BlockStatement
lib/option.js:279:14
     options.forEach((option) => {
       if (option.negate) {
         this.negativeOptions.set(option.attributeName(), option);
-      } else {
-        this.positiveOptions.set(option.attributeName(), option);
-      }
+      } else {}
     });
     this.negativeOptions.forEach((value, key) => {

[Timeout] BlockStatement
lib/option.js:283:50
         this.positiveOptions.set(option.attributeName(), option);
       }
     });
-    this.negativeOptions.forEach((value, key) => {
-      if (this.positiveOptions.has(key)) {
-        this.dualOptions.add(key);
-      }
-    });
+    this.negativeOptions.forEach((value, key) => {});
   }
 

[Timeout] BlockStatement
lib/option.js:284:42
       }
     });
     this.negativeOptions.forEach((value, key) => {
-      if (this.positiveOptions.has(key)) {
-        this.dualOptions.add(key);
-      }
+      if (this.positiveOptions.has(key)) {}
     });
   }

[Timeout] ConditionalExpression
lib/option.js:284:11
       }
     });
     this.negativeOptions.forEach((value, key) => {
-      if (this.positiveOptions.has(key)) {
+      if (false) {
         this.dualOptions.add(key);
       }

[Timeout] BlockStatement
lib/option.js:297:34
    * @param {Option} option
    * @returns {boolean}
    */
-  valueFromOption(value, option) {
-    const optionKey = option.attributeName();
-    if (!this.dualOptions.has(optionKey)) return true;
-
-    // Use the value to deduce if (probably) came from the option.
-    const preset = this.negativeOptions.get(optionKey).presetArg;
-    const negativeValue = preset !== undefined ? preset : false;
-    return option.negate === (negativeValue === value);
-  }
+  valueFromOption(value, option) {}
 }
 

[Timeout] ConditionalExpression
lib/option.js:299:9
    */
   valueFromOption(value, option) {
     const optionKey = option.attributeName();
-    if (!this.dualOptions.has(optionKey)) return true;
+    if (true) return true;
 
     // Use the value to deduce if (probably) came from the option.

[Timeout] BooleanLiteral
lib/option.js:299:50
    */
   valueFromOption(value, option) {
     const optionKey = option.attributeName();
-    if (!this.dualOptions.has(optionKey)) return true;
+    if (!this.dualOptions.has(optionKey)) return false;
 
     // Use the value to deduce if (probably) came from the option.

[Timeout] ConditionalExpression
lib/option.js:303:27
 
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
-    const negativeValue = preset !== undefined ? preset : false;
+    const negativeValue = false ? preset : false;
     return option.negate === (negativeValue === value);
   }

[Timeout] EqualityOperator
lib/option.js:303:27
 
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
-    const negativeValue = preset !== undefined ? preset : false;
+    const negativeValue = preset === undefined ? preset : false;
     return option.negate === (negativeValue === value);
   }

[Timeout] EqualityOperator
lib/option.js:304:31
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
     const negativeValue = preset !== undefined ? preset : false;
-    return option.negate === (negativeValue === value);
+    return option.negate === (negativeValue !== value);
   }
 }

[Timeout] EqualityOperator
lib/option.js:304:12
     // Use the value to deduce if (probably) came from the option.
     const preset = this.negativeOptions.get(optionKey).presetArg;
     const negativeValue = preset !== undefined ? preset : false;
-    return option.negate === (negativeValue === value);
+    return option.negate !== (negativeValue === value);
   }
 }

[Timeout] BlockStatement
lib/option.js:316:25
  * @private
  */
 
-function camelcase(str) {
-  return str.split('-').reduce((str, word) => {
-    return str + word[0].toUpperCase() + word.slice(1);
-  });
-}
+function camelcase(str) {}
 
 /**

[Timeout] BlockStatement
lib/option.js:317:47
  */
 
 function camelcase(str) {
-  return str.split('-').reduce((str, word) => {
-    return str + word[0].toUpperCase() + word.slice(1);
-  });
+  return str.split('-').reduce((str, word) => {});
 }
 

[Timeout] ArithmeticOperator
lib/option.js:318:12
 
 function camelcase(str) {
   return str.split('-').reduce((str, word) => {
-    return str + word[0].toUpperCase() + word.slice(1);
+    return str - word[0].toUpperCase() + word.slice(1);
   });
 }

[Timeout] MethodExpression
lib/option.js:318:18
 
 function camelcase(str) {
   return str.split('-').reduce((str, word) => {
-    return str + word[0].toUpperCase() + word.slice(1);
+    return str + word[0].toLowerCase() + word.slice(1);
   });
 }

[Timeout] Regex
lib/option.js:334:23
   // short flag, single dash and single character
   const shortFlagExp = /^-[^-]$/;
   // long flag, double dash and at least one character
-  const longFlagExp = /^--[^-]/;
+  const longFlagExp = /--[^-]/;
 
   const flagParts = flags.split(/[ |,]+/).concat('guard');

[Timeout] ConditionalExpression
lib/option.js:338:7
 
   const flagParts = flags.split(/[ |,]+/).concat('guard');
   // Normal is short and/or long.
-  if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
+  if (true) shortFlag = flagParts.shift();
   if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.

[Timeout] ConditionalExpression
lib/option.js:338:7
 
   const flagParts = flags.split(/[ |,]+/).concat('guard');
   // Normal is short and/or long.
-  if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
+  if (false) shortFlag = flagParts.shift();
   if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.

[Timeout] ConditionalExpression
lib/option.js:339:7
   const flagParts = flags.split(/[ |,]+/).concat('guard');
   // Normal is short and/or long.
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
-  if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
+  if (false) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.
   if (!shortFlag && shortFlagExp.test(flagParts[0]))

[Timeout] ConditionalExpression
lib/option.js:339:7
   const flagParts = flags.split(/[ |,]+/).concat('guard');
   // Normal is short and/or long.
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
-  if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
+  if (true) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.
   if (!shortFlag && shortFlagExp.test(flagParts[0]))

[Timeout] BooleanLiteral
lib/option.js:341:7
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
   if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.
-  if (!shortFlag && shortFlagExp.test(flagParts[0]))
+  if (shortFlag && shortFlagExp.test(flagParts[0]))
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'

[Timeout] ConditionalExpression
lib/option.js:341:7
   if (shortFlagExp.test(flagParts[0])) shortFlag = flagParts.shift();
   if (longFlagExp.test(flagParts[0])) longFlag = flagParts.shift();
   // Long then short. Rarely used but fine.
-  if (!shortFlag && shortFlagExp.test(flagParts[0]))
+  if (true)
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'

[Timeout] ConditionalExpression
lib/option.js:345:7
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'
   // This is the supported way to have a shortish option flag.
-  if (!shortFlag && longFlagExp.test(flagParts[0])) {
+  if (false) {
     shortFlag = longFlag;
     longFlag = flagParts.shift();

[Timeout] ConditionalExpression
lib/option.js:345:7
     shortFlag = flagParts.shift();
   // Allow two long flags, like '--ws, --workspace'
   // This is the supported way to have a shortish option flag.
-  if (!shortFlag && longFlagExp.test(flagParts[0])) {
+  if (true) {
     shortFlag = longFlag;
     longFlag = flagParts.shift();

[Timeout] ConditionalExpression
lib/option.js:351:7
   }
 
   // Check for unprocessed flag. Fail noisily rather than silently ignore.
-  if (flagParts[0].startsWith('-')) {
+  if (false) {
     const unsupportedFlag = flagParts[0];
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;

[Timeout] ConditionalExpression
lib/option.js:351:7
   }
 
   // Check for unprocessed flag. Fail noisily rather than silently ignore.
-  if (flagParts[0].startsWith('-')) {
+  if (true) {
     const unsupportedFlag = flagParts[0];
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;

[Timeout] ConditionalExpression
lib/option.js:354:9
   if (flagParts[0].startsWith('-')) {
     const unsupportedFlag = flagParts[0];
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;
-    if (/^-[^-][^-]/.test(unsupportedFlag))
+    if (false)
       throw new Error(
         `${baseError}

[Timeout] ConditionalExpression
lib/option.js:354:9
   if (flagParts[0].startsWith('-')) {
     const unsupportedFlag = flagParts[0];
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;
-    if (/^-[^-][^-]/.test(unsupportedFlag))
+    if (true)
       throw new Error(
         `${baseError}

[Timeout] StringLiteral
lib/option.js:356:9
     const baseError = `option creation failed due to '${unsupportedFlag}' in option flags '${flags}'`;
     if (/^-[^-][^-]/.test(unsupportedFlag))
       throw new Error(
-        `${baseError}
-- a short flag is a single dash and a single character
-  - either use a single dash and a single character (for a short flag)
-  - or use a double dash for a long option (and can have two, like '--ws, --workspace')`,
+        ``,
       );
     if (shortFlagExp.test(unsupportedFlag))

[Timeout] ConditionalExpression
lib/option.js:361:9
   - either use a single dash and a single character (for a short flag)
   - or use a double dash for a long option (and can have two, like '--ws, --workspace')`,
       );
-    if (shortFlagExp.test(unsupportedFlag))
+    if (true)
       throw new Error(`${baseError}
 - too many short flags`);

[Timeout] ConditionalExpression
lib/option.js:361:9
   - either use a single dash and a single character (for a short flag)
   - or use a double dash for a long option (and can have two, like '--ws, --workspace')`,
       );
-    if (shortFlagExp.test(unsupportedFlag))
+    if (false)
       throw new Error(`${baseError}
 - too many short flags`);

[Timeout] StringLiteral
lib/option.js:362:23
   - or use a double dash for a long option (and can have two, like '--ws, --workspace')`,
       );
     if (shortFlagExp.test(unsupportedFlag))
-      throw new Error(`${baseError}
-- too many short flags`);
+      throw new Error(``);
     if (longFlagExp.test(unsupportedFlag))
       throw new Error(`${baseError}

[Timeout] ConditionalExpression
lib/option.js:364:9
     if (shortFlagExp.test(unsupportedFlag))
       throw new Error(`${baseError}
 - too many short flags`);
-    if (longFlagExp.test(unsupportedFlag))
+    if (false)
       throw new Error(`${baseError}
 - too many long flags`);

[Timeout] ConditionalExpression
lib/option.js:364:9
     if (shortFlagExp.test(unsupportedFlag))
       throw new Error(`${baseError}
 - too many short flags`);
-    if (longFlagExp.test(unsupportedFlag))
+    if (true)
       throw new Error(`${baseError}
 - too many long flags`);

[Timeout] StringLiteral
lib/option.js:365:23
       throw new Error(`${baseError}
 - too many short flags`);
     if (longFlagExp.test(unsupportedFlag))
-      throw new Error(`${baseError}
-- too many long flags`);
+      throw new Error(``);
 
     throw new Error(`${baseError}

[Timeout] EqualityOperator
lib/option.js:371:34
     throw new Error(`${baseError}
 - unrecognised flag format`);
   }
-  if (shortFlag === undefined && longFlag === undefined)
+  if (shortFlag === undefined && longFlag !== undefined)
     throw new Error(
       `option creation failed due to no flags found in '${flags}'.`,

[Timeout] ConditionalExpression
lib/option.js:371:7
     throw new Error(`${baseError}
 - unrecognised flag format`);
   }
-  if (shortFlag === undefined && longFlag === undefined)
+  if (false)
     throw new Error(
       `option creation failed due to no flags found in '${flags}'.`,

[Timeout] StringLiteral
lib/option.js:373:7
   }
   if (shortFlag === undefined && longFlag === undefined)
     throw new Error(
-      `option creation failed due to no flags found in '${flags}'.`,
+      ``,
     );
 
